{
  "Name": "UK Government IT incompetence: hmcourts-service.gov.uk",
  "Type": "BlogPost",
  "CreateDate": "2010-04-06T09:34:00",
  "UpdateDate": "2015-01-19T18:42:38",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2010/4/6/uk-government-it-incompetence-hmcourts-servicegovuk/",
  "RelativeUrl": "/2010/4/6/uk-government-it-incompetence-hmcourts-servicegovuk/",
  "Content": {
    "umbracoUrlAlias": "/uk-government-it-incompetence-hmcourts-servicegovuk",
    "HideInNavigation": true,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2010-04-06T09:34:00Z",
    "title": "",
    "shortUrl": "http://bit.ly/hDa3mT",
    "summary": "'UK Government IT incompetence: hmcourts-service.gov.uk' - a blog post by Darren Ferguson about Internet Explorer, Governor, internet browser, government services, Brown, Prime Minister, web manager/commissioner, Technology Internet written on 06 April 2010",
    "tags": "Internet Explorer, Governor, internet browser, government services, Brown, Prime Minister, web manager/commissioner, Technology Internet",
    "bodyText": "<p>\r\nPrime minister Brown recently proposed <a href=\"http://www.guardian.co.uk/technology/2010/mar/22/mygov-personalised-government-web-services\"><em>a dashboard that allows every citizen to personalise the explosive growth of government services on the web</em></a>. Personally I think the government should stick to the basics.\r\n</p><p>\r\nFollowing on from a previous blog post <a href=\"http://www.darren-ferguson.com/2009/1/30/uk-government-it-incompetency-fcogovuk.aspx\">UK Government IT incompetence: fco.gov.uk</a> I'm sad to report another far from satisfying experience, this time with  hmcourts-service.gov.uk\r\n</p><p>\r\nI tried to make a simple form submission on the site and received a message along the lines of \"We cannot accept your submission at this time: Please try again later\". So try again later I did - several times.\r\n</p><p>\r\nPatience exhausted I fired an email off to their customer support team only to receive this exasperating response:\r\n</p><p><em>\r\nThank you for your email. If problems persist, please provide your user ID and password and we will  investigate the matter further, or, alternatively you can call our helpdesk on the number below who will be able to talk you through it.\r\n</em></p><p><em>\r\nPlease check for any other error messages.\r\n</em></p><p><em>\r\nPlease note - your particulars of claim must be no more than 24 lines totalling no more than 1080 characters (including space and punctuation). Also, that the only punctuation you can use is full stops or commas - all other punctuation is treated by our system as illegal characters, including £  and &amp; signs.\r\n</em></p><p><em>\r\nCan you confirm which internet browser you are using as the site is only compatible with Internet Explorer at the moment. If you're using another browser you may have to switch to a machine that has Internet Explorer in order to submit your claim.\r\n</em></p><p>\r\nNow you my readers are more than aware what is wrong with this - on so many levels. \r\n</p><p>\r\nMy plea then is to the government. Why in this day and age do you have so many difficulties building a simple website? It isn't difficult. With so many qualified agencies out there why do you continually pick those who are simply useless?</p><p>\r\nA genuine offer if anyone who commissions government websites stumbles across this post. I will come and see you free of charge and explain the issues with government websites, how they can be addressed at a minimial cost and how to appoint a web manager/commissioner who understands the basics of the web.\r\n</p>",
    "commentsDisabled": ""
  },
  "Template": "Post",
  "CacheTime": null,
  "SortOrder": 1,
  "Level": 5
}