{
  "Name": "RANT: My day rate is my rate, not your rate",
  "Type": "BlogPost",
  "CreateDate": "2009-08-04T22:06:00",
  "UpdateDate": "2015-01-19T18:41:18",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2009/8/4/rant-my-day-rate-is-my-rate-not-your-rate/",
  "RelativeUrl": "/2009/8/4/rant-my-day-rate-is-my-rate-not-your-rate/",
  "Content": {
    "umbracoUrlAlias": "/rant-my-day-rate-is-my-rate,-not-your-rate",
    "HideInNavigation": true,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2009-08-04T22:06:00Z",
    "title": "",
    "shortUrl": "http://bit.ly/eE4UVu",
    "summary": "'RANT: My day rate is my rate, not your rate' - a blog post by Darren Ferguson about hair stylist, architect, Human Interest written on 04 August 2009",
    "tags": "hair stylist, architect, Human Interest",
    "bodyText": "<p>It isn't often I get frustrated enough to write a ranting blog\r\npost but I've been getting pretty steamed up with some of the\r\ncommunication I've been getting recently from prospective\r\nclients.</p><p>I get a fair amount of email each week asking me if I'm\r\ninterested in working on a project. Luckily I'm privileged to be\r\nbusy right now and I'll usually - <em>politely</em> - decline.\r\nOccasionally, if the project seems of interest and I have the time\r\nto commit to it I'll write back outlining some initial thoughts, my\r\nterms of business and importantly my hourly and day rates.</p><p>Some may question the fact that I get down to money so quickly,\r\nbut I've become quite adept at spotting emails where budget is\r\nlikely to cause issues. Many of these emails even start with\r\nsentences like \"I need some cheap Umbraco/TeamSite development\r\nwork\", so I think it is important to put my rates out there to save\r\neveryone some time.</p><p>Ordinarily if costs are an issue myself and the potential client\r\nagree that our working together on the project in question isn't\r\ngoing to work out and bid each other a polite good day. From time\r\nto time I'll get a reaction along the lines of \"wow, that's\r\nexpensive\" and I'll usually take the time to explain that a hair\r\nstylist with 15 years experience is likely to give a better haircut\r\nthan a trainee barber. This sometimes gets mistaken for arrogance\r\nbut I do stand by the metaphor.</p><p>By this point you are probably thinking I'm charging silly\r\nextortionate rates but I'm not. I keep an eye on the market and\r\ncharge a good value price that is fair for a contract CMS\r\narchitect/developer with 12 years commercial experience.</p><p>So where's the beef? Well, more and more frequently I'm getting\r\nindividuals who decide to confront me. These people try to tell me\r\nhow to run my business and what I should charge. Here are some\r\ngenuine quotes from emails that I've received in the past 6\r\nmonths.</p><ul><li>\"I could get that done for £300 with Joomla\" - (A whole\r\nwebsite)</li><li>\"You are being ridiculous - nobody will pay that\"</li><li>\"You should be careful with the recession it is very likely\r\nthat you will be out of a job soon\"</li><li>\"You've wasted my time which I am annoyed about you should be\r\nmore realistic about your expectations in future\"</li></ul><p>Those are a few of my \"favourites\" and there are many more but\r\nthe point is that I am getting sick of defending myself when I\r\nshouldn't have to.</p><p>In order to end silly and futile process of people trying to\r\ndictate to me how I should earn my living, future such emails will\r\nbe responded to with a link to this post and further - negative -\r\ncorrespondence ignored.</p><p>In case you are reading this as a result of receiving such an\r\nemail from me here is all that you need to know. If you don't want\r\nto work with me then that is fine but\r\n<em><strong>never</strong></em> make the mistake of telling me what\r\nI am worth. If budget is an issue and you are prepared to\r\ncompromise quality to reduce the price of your project I may even\r\nbe able to recommend someone. What I won't do any longer is defend\r\nmyself against personal attacks, such attacks will be greeted with\r\na barrage - <em>of silence</em>.</p>",
    "commentsDisabled": ""
  },
  "Template": "Post",
  "CacheTime": null,
  "SortOrder": 1,
  "Level": 5
}