{
  "Name": "If you want rid of IE6 then start doing something practical about it",
  "Type": "BlogPost",
  "CreateDate": "2009-08-24T21:53:00",
  "UpdateDate": "2015-01-19T18:41:17",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2009/8/24/if-you-want-rid-of-ie6-then-start-doing-something-practical-about-it/",
  "RelativeUrl": "/2009/8/24/if-you-want-rid-of-ie6-then-start-doing-something-practical-about-it/",
  "Content": {
    "umbracoUrlAlias": "/if-you-want-rid-of-ie6-then-start-doing-something-practical-about-it",
    "HideInNavigation": true,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2009-08-24T21:53:00Z",
    "title": "",
    "shortUrl": "http://bit.ly/fiUERD",
    "summary": "'If you want rid of IE6 then start doing something practical about it' - a blog post by Darren Ferguson about cases software projects, CTO, gimmicky web, web developer, Thatcher, craftsman written on 24 August 2009",
    "tags": "cases software projects, CTO, gimmicky web, web developer, Thatcher, craftsman",
    "bodyText": "<p>This post should be subtitled \"or stop moaning\".</p><p>As a pre-cursor to the main content of my post a note to CSS\r\ndevelopers.  <em>Be careful what you set your heart upon.</em>\r\nIf IE6 was banished/killed/gone what would differentiate you from\r\nany other web developer? If anyone could pick up a manual and learn\r\nCSS, and all browsers rendered your markup exactly as intended\r\nwould that not render your x years of experience redundant?\r\nWouldn't the market become saturated with talentless newbies who\r\ncould do your job just as well as you could? Wouldn't rates of\r\nremuneration inevitably plummet? Is that what you really want?</p><p>Do you not think in some way that you enjoy the challenge of\r\nthose quirks and frustrations that IE6 cause you? Isn't that what\r\nsets you apart from the crowd and makes you are craftsman? Sure,\r\neverybody loves to moan from time to time it's a human condition -\r\nbut do you really mean it?</p><p>Having gotten that out of the way, let me state clearly that I\r\nwould like to see the end of IE6 too. Although I rarely get hands\r\non with browsers from day to day I have done in the past. I'm aware\r\nof the frustrations and I think it is a completely legitimate\r\nmovement to get people to install modern standards compliant\r\nbrowsers.</p><p>I take issue with the way people go about it.</p><ol><li>Complain about it on Twitter/blog or some other rant\r\noutlet.</li><li>Drop support.</li><li>Sign up to some silly petition site.</li></ol><p>I'm not too bothered about #1. Everyone needs to let off steam,\r\nbut if you find yourself repeatedly ranting about IE6 on twitter it\r\nis probably a sign that it is consuming too much of your time and\r\nyou should stand up and do something about it.</p><p>I find #2 concerning. I have quite recently been party to\r\ndiscussions where developers have seriously contemplated just\r\ndropping support between versions of their product. This simply\r\nisn't on. If you have previously supported IE6, have not informed\r\nyour user base that you are dropping IE6 support then you should be\r\ncommitted to support until such time that you've communicated to\r\nyour customer your EOL plan. If you've never supported IE6 or are\r\nsome gimmicky web 2.0 site then I guess it is your call.</p><p>Now for #3. We've seen a series of sites recently such as <a href=\"http://idroppedie6.com/\">I dropped IE6</a>, <a href=\"http://ie6update.com/\">IE6 Update</a>, <a href=\"http://www.ie6nomore.com/\">IE6 No more</a> and <a href=\"http://ie6offenders.com/\">IE6 offenders</a>. Each of these -\r\nin their own way - is trying to get people to upgrade their browser\r\n(though the cynic in me says that they are actually just trying to\r\nride a trending publicity wave).</p><p>I'm not going to theorise over how to get home end users to\r\nupgrade their browsers but I will say that all of these sites are\r\npractically pointless when it comes to breaking through a corporate\r\nIT policy. Here is why:</p><ul><li>Most corporate organisations don't allow their users to install\r\nanything. Privileges on their PC will be locked down to prevent\r\nthis.</li><li>Even if a user had admin rights a large percentage of them\r\nwouldn't know how to upgrade their browser so IT would still have\r\nto do the rollout and a 10,000 desk software rollout is\r\nexpensive.</li><li>The testing of legacy applications in a new browser could be a\r\nvast expensive and time consuming project in its own right costing\r\nseveral million (pounds/euros/dollars).</li><li>Do you honestly think your employer cares if you can't watch\r\nyoutube at work because your browser isn't up to date?</li><li>Many large corporate organisations will do their security at a\r\ngateway/proxy level rather than addressing browser security issues.\r\nIt is much more cost effective.</li></ul><p>Even if your stop IE6 campaign works around all of the points\r\nabove, what is out there right now is still painfully thin on real\r\ninformation on *why* people should upgrade their browser. This\r\ninformation needs to be clear, concise and readable by someone at\r\nexecutivelevel. Here is a hint: the CTO isn't going to approve\r\nbrowser upgrades on the basis that it makes your job easier. The\r\ninformation out there right now is scant, and presenting a protest\r\nweb site URL to your CTO would make you look a bit silly to say the\r\nvery least - if you were running for office in your local\r\nelections, would you campaign with a one page manifesto?</p><p>Finally, some of these sites are targeting the wrong people.\r\nGetting a million developers to sign a petition against IE6 is like\r\ntrying to convince a million conservatives that Thatcher was a\r\ngreat woman.</p><p>So what do I suggest? If you are definitely not prepared to wait\r\nfor the eventual demise of IE6 and work within a large organisation\r\nthat still uses it:</p><ol><li>Prepare some good documentation on why IE6 is bad in executive\r\nfriendly language - you could possibly even start an open source\r\ncollaboration on such a document.</li><li>Include real information on how IE6 costs your organisation\r\nmoney on a day to day basis. Wasted dev/testing hours, time spent\r\npatching, blocking sites on the firewall etc.</li><li>Create an internal audience. Circulate your document within\r\nyour organisation targeting the most senior people that you have\r\naccess to.</li></ol><p>Sure, you'll likely get nowhere but <em>'Tis better to have\r\nloved and lost Than never to have loved at all.</em></p><p>Unfortunately in many many cases software projects are initiated\r\ndue to palms being greased and the right people being wined and\r\ndined rather than any practical considerations. This is something\r\noutside of the sway of the lowly developer and unfortunately\r\nsometimes we have to accept that we just aren't that important.</p>",
    "commentsDisabled": ""
  },
  "Template": "Post",
  "CacheTime": null,
  "SortOrder": 1,
  "Level": 5
}