{
  "Name": "eton.kotov90@yandex.ru",
  "Type": "BlogComment",
  "CreateDate": "2015-09-15T07:23:41.1508337+00:00",
  "UpdateDate": "2015-09-15T07:23:41.1508337+00:00",
  "CreatorName": "User Generated",
  "WriterName": "User Generated",
  "Url": "http://localhost/2011/4/13/a-little-blog-tlc/0e15f54b-3a76-4033-ba53-12b038209933/",
  "RelativeUrl": "/2011/4/13/a-little-blog-tlc/0e15f54b-3a76-4033-ba53-12b038209933/",
  "Content": {
    "name": "gennikmarketgid",
    "email": "eton.kotov90@yandex.ru",
    "bodyText": "Пожалуйста, позвольте поиску проиндексировать данное сообщение, о маркетгиде нет плохих отзывов, хотя на самом деле это та еще парашная контора. Выкладываю свою переписку с ними, дабы все в этом могли убедиться. <br/> <br/>8.08.2015 17:25:19] *** Пользователь marketgid.com хочет внести вас в свой список контактов SkypeЗдравствуйте, Клиент! Я хочу внести Вас в свой список контактов в Skype. Сопровождающий менеджер от MarketGid *** <br/>8.08.2015 17:37:20] *** Клиент отправил контактные данные marketgid.com. *** <br/>9.08.2015 9:39:31] marketgid.com: Приветствую, Клиент! <br/>9.08.2015 9:39:50] marketgid.com: Есть ряд вопросов по поводу отслеживания эффективности сайта магазин. <br/>9.08.2015 9:40:30] marketgid.com: Если на сайте есть счетчик метрики, можете выделить мне доступ на уровне просмотра на почту af.marketgid, я тогда смогу регулировать настройки вашей кампании, улучшать трафик, исключать не эффективные площадки (блэк лист)  по согласованию с вами. <br/>9.08.2015 9:40:55] marketgid.com: По вчерашней открутке есть результаты? <br/>9.08.2015 9:44:55] marketgid.com: Там на сайте есть метрика, может, они дадут доступ гостевой. <br/>9.08.2015 9:45:37] Клиент: Я дам вам доступ, в зависимости от того что покажет проверка результатов <br/>9.08.2015 9:45:51] Клиент: От этого же зависит наше дальнейшее сотрудничество <br/>9.08.2015 9:47:35] marketgid.com: В любом случае, есть дорогие площадки по затратам и тизеры, мы имеем возможность их исключить. <br/>9.08.2015 9:47:46] marketgid.com: Если они будут. <br/>9.08.2015 9:54:16] marketgid.com: Я думаю, если будете запускаться, лого на всех тизерах просто Обязательно ставить нужно плюс создать рекламные кампании по разделению тематик площадок, например, есть строительство, дом, дача, женские сайты и тд... Ну и общую рк на все сайты, тестировать результат. <br/>9.08.2015 9:55:03] Клиент: по результатам я пока что вижу, что гдето 20-30% тупо скликано <br/>9.08.2015 9:55:57] Клиент: Я вам дал гостевой доступ <br/>9.08.2015 9:58:07] marketgid.com: У вас есть данные о той цене заказа, которая должна быть? Процент конверсии, на который ориентируемся? <br/>9.08.2015 9:58:41] Клиент: Какая может быть конверсия когда треть денег за кампанию уходят в пустоту <br/>9.08.2015 10:00:47] marketgid.com: Важно понять на начале сотрудничества такие данные, что бы на них ориентироваться. Плюс рассмотрите мои рекомендации. Важно ставить цену товара и скидку, если она есть. Это отсечет часть аудитории, которая просто заходит посмотреть. А привлечет более целевых... <br/>9.08.2015 10:02:59] Клиент: Вот зря вы так говорите. <br/>9.08.2015 10:03:09] Клиент: Это к вам ни капли доверия не прибавляет <br/>9.08.2015 10:03:11] Клиент: Даже наоборот <br/>9.08.2015 10:03:29] marketgid.com: Страница посещения корзины - 2 от нас, мало, конечно, но есть над чем работать. <br/>9.08.2015 10:03:54 | Изменены 10:05:26] marketgid.com: А откуда недоверие? Вы пришли закупать трафик в компанию, которой не доверяете? <br/>9.08.2015 10:04:11] Клиент: Вы откройте вебвизор и посмотрите <br/>9.08.2015 10:07:33] Клиент: И я никому не доверяю в сети. <br/>9.08.2015 10:09:32] marketgid.com: Можете не доверять, ваше личное право и мнение, нам же нужно прийти к общему решению по оптимизации, если вы планируете продлевать работу. <br/>9.08.2015 10:10:17] marketgid.com: Если в вебвизоре что то заметили, расскажите, что и где, там же данные в перемешку с другими рекламными сервисами. <br/>9.08.2015 10:10:33] marketgid.com: Может, лучше я выгружу отчет? <br/>9.08.2015 10:11:16] Клиент: Можете и выгрузить, только какая разница. <br/>9.08.2015 10:11:34] marketgid.com: Не поняла))) <br/>9.08.2015 10:12:03] Клиент: Ну вы хотите скачать отчет сформированный метрикой? <br/>9.08.2015 10:12:32] marketgid.com: Построить отчет по площадкам и тизерам именно с нашими метками <br/>9.08.2015 10:13:04] Клиент: ну выгрузите если вам так будет понятнее <br/>9.08.2015 10:13:59] marketgid.com: На какие показатели мне ориентироваться? Что мы будем исключать? Какая глубина просмотра должна быть, к-ство страниц, допустимый отказ?... <br/>9.08.2015 10:14:50] Клиент: Количество ботов <br/>9.08.2015 10:15:47] marketgid.com: В нашей системе за этим следит другой отдел и штрафует площадки, а вам не засчитывают клики, если есть подозрение в накрутке. <br/>9.08.2015 10:16:17] Клиент: Да у меня полстраницы вебвизора этих подозрений, возьмите всех с маркетгида у кого 0 активность <br/>9.08.2015 10:17:02] Клиент: Вы знаете как работает вебвизор? <br/>9.08.2015 10:17:12] marketgid.com: Яндекс и Аналитикс могут не учитывать пребывание на сайте, если не было переходов по самому сайту, и даже если сайт будет открыт в браузере час, или более, то время может выдать: 00:00:00, так как Яндекс Метрика и Гугл Аналитикс не всегда, а точнее, практически не учитывают скролинг по сайту за действие. <br/>9.08.2015 10:19:00] Клиент: Вы ошибаетесь насчет скроллинга, 0 действия без возможности отслеживания появляются тогда, когда не выполняет жс. А это бывает в двух случаях <br/>9.08.2015 10:19:12] Клиент: Либо если у пользователя он отключен, что бывает очень редко <br/>9.08.2015 10:19:17] Клиент: Либо если это бот. <br/>9.08.2015 10:19:21] Клиент: Причем примитивный <br/>9.08.2015 10:21:12] Клиент: Причем у метрики вебвизор идет отдельно, то есть чтобы показаться строчкой в вебвизоре достаточно загрузить скрипт метрики, но не обязательно его выполнять. <br/>9.08.2015 10:21:51] Клиент: Версия системы и браузера достаются из юзерагента <br/>9.08.2015 10:22:31] Клиент: Вы знаете как устроен протокол HTTP? <br/>9.08.2015 10:26:51] marketgid.com: Клиент, многие жалуются на ботовость и прочее, но доказать, что именно этот пользователь бот, никто не может. Нам не выгодно пропускать подозрительный трафик, нам важно, что бы клиенты оставались с нами, потому над улучшением трафика работает отдел аналитики. У меня есть очень много клиентов с долгосрочным сотрудничеством более двух-трех лет, некоторые с 2009 года размещаются. Мне сейчас главное понять рычаги управления конверсией именно на этом сайте.  Давайте конкретнее перейдем к вопросу, что исключаем из показа, что оставим. Инструментов для улучшения трафика масса. <br/>9.08.2015 10:27:28] Клиент: Вы должно быть шутите да? <br/>9.08.2015 10:27:53] Клиент: Какие вы принимаете доказательства ботовости? <br/>9.08.2015 10:35:51] Клиент: Более того, по вашей стате за 18 число был 991 переход, в метрике их только 706 <br/>9.08.2015 10:36:06] Клиент: Из них гдето треть это боты <br/>9.08.2015 10:36:21] Клиент: Итого скручена половина трафика <br/>9.08.2015 10:36:29] Клиент: 50% <br/>9.08.2015 10:36:57] Клиент: Вы понимаете что это вообще никуда не годится? <br/>9.08.2015 10:37:16] Клиент: Так по стате не шейвят даже самые черные дорвейные партнерки <br/>9.08.2015 10:43:37] marketgid.com: Вообще расхождение между независимыми статистиками может превышать 15-20% <br/>9.08.2015 10:44:22] Клиент: Может вы сейчас меня попытаетесь в этом убедить? <br/>9.08.2015 10:45:32] Клиент: Я имею дело с трафиком с 2006 года, я знаю что может быть, а что нет. Более того, я сам делал ботов. <br/>9.08.2015 10:45:47] Клиент: Вы точно уверены что хотите попытаться меня обмануть таким образом? <br/>9.08.2015 10:46:50] marketgid.com: Ну почему сразу обмануть :( <br/>9.08.2015 10:47:34] Клиент: Потому что это обман <br/>9.08.2015 10:48:28] marketgid.com: Мне нужно хоть какое то взаимодействие, если его нет, как мы будем работать? <br/>9.08.2015 10:49:05] Клиент: А какая работа может быть если вы в упор не видите что 50% бюджета было выброшено в мусор? <br/>9.08.2015 10:49:09] marketgid.com: Какой вариант работы вас бы устроил? <br/>9.08.2015 10:50:16] Клиент: Вы возвращаете 25 долларов на счет в маркетгиде и баните все площадки с которых приходят нулевые, а также по своей внутренней стате баните площадки откуда люди не дошли. <br/>9.08.2015 10:50:45] Клиент: И тогда можно попробовать продолжить сотрудничество <br/>9.08.2015 10:51:20] marketgid.com: Я обсужу это с руководством <br/>9.08.2015 14:13:23] marketgid.com: Наши аналитики рассмотрели вашу рекламную кампанию и пояснили, что метрика считает время прибывания на сайте, как разницу между загрузками своих счетчиков, тоесть время на последней странице может не попадать в расчет, поэтому, если время ноль, это не значит, что он на странице был 0 секунд, он мог совершать какие либо действия, заполнять формы, но дальше переход не делать, время так же запишет 0, всего таких кликов 300 по стате метрики, можем взять и отключить площадки, с которых таких кликов было к примеру больше, но это не значит что <br/>это боты и не живые посетители, по расхождению там за вчера меньше 15% разница, это  не критично. <br/>9.08.2015 14:40:31] Клиент: Ваши аналитике либо полные идиоты без знания матчасти вообще, либо вы мне врете. А допустимое расхождение до 0.5%. <br/>9.08.2015 15:48:36] Клиент: Так что больше я к вам клиентов не поведу. <br/>9.08.2015 15:50:13] marketgid.com: Ну мы еще в процессе обсуждения <br/>1:14:02] marketgid.com: Приветствую, Клиент <br/>1:15:11] marketgid.com: Руководство не утвердило возврат. Просто вы можете и дальше не соглашаться и придумывать нам новые условия к нашему трафику, а дальше по этому поводу можете требовать возврат, в свободном доступе есть много статей которые обьясняют как считается время пребывания на странице. <br/>1:19:35] Клиент: покажите мне хотя бы одну не вашу статью где будет написано что это норма. <br/>1:22:37] marketgid.com: зайдите ко мне в фейсбук <br/>1:24:13] Клиент: я не знаю ваш фейсбук <br/>1:36:13] Клиент: собственно вот вам выдержка о работе вебвизора от яндекс https://yandex.ru/support/metrika-old/qanda/webvisor-qanda.xml#passwords <br/>1:37:34] marketgid.com: да, и там несколько причин <br/>1:37:44] Клиент: И ни одной из причин которые вы указали <br/>1:38:14] marketgid.com: посетитель уходит не дождавшись сессии, не производит действия по сайту <br/>1:38:45] Клиент: Уходит не загрузив страницу <br/>1:38:53] Клиент: А если такие пользователи попадают по вашей рекламе <br/>1:39:00] Клиент: То это либо скликивание <br/>1:39:03] Клиент: Либо боты <br/>1:39:07] Клиент: Либо скликивание ботами <br/>1:39:14] Клиент: Ну или читинг <br/>1:45:03] marketgid.com: Клиент, у нас масса возможностей по оптимизации и много клиентов, которые Хотят с нами работать. <br/>1:45:38] Клиент: Попытка увести разговор в сторону вы только теряете баллы. <br/>1:46:10] Клиент: Вы либо признаете что вы отказываете в возврате на основании того, что вы просто не хотите вернуть деньги. Либо из возвращаете. <br/>1:46:27] marketgid.com: Мы не возвращаем. <br/>1:46:36] marketgid.com: Причины описаны были выше <br/>1:46:55] Клиент: А я вам говорю что ваши причины выдумка и предоставляю тому доказательства. <br/>1:47:00] Клиент: Которые я привел выше. <br/>1:47:16] marketgid.com: И? <br/>1:47:52] Клиент: Ну у меня есть аргумент в мою пользу, у вас нет. Следовательно я прав, вы нет. <br/>1:48:00] marketgid.com: Что дальше? <br/>1:48:12] marketgid.com: Вы остаетесь при своем, мы при своем <br/>1:48:32] Клиент: Ну вы либо возвращаете деньги, либо признаете что отказываетесь возвращать из жадности. <br/>1:48:38] marketgid.com: Я вообще советовала бы нашу статистику вешать <br/>1:48:43] marketgid.com: :) <br/>1:48:55] marketgid.com: Мы не возвращаем."
  },
  "Template": "",
  "CacheTime": null,
  "SortOrder": 4,
  "Level": 6
}