{
  "Name": "Ferguson Moriyama and Umbraco 5",
  "Type": "BlogPost",
  "CreateDate": "2012-01-27T15:29:58",
  "UpdateDate": "2015-01-19T18:43:48",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2012/01/27/ferguson-moriyama-and-umbraco-5/",
  "RelativeUrl": "/2012/01/27/ferguson-moriyama-and-umbraco-5/",
  "Content": {
    "umbracoUrlAlias": "",
    "HideInNavigation": false,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2012-01-27T15:25:00Z",
    "title": "Ferguson Moriyama and Umbraco 5",
    "shortUrl": "http://djf.so/AeJyNU ",
    "summary": "'Ferguson Moriyama and Umbraco 5' - a blog post by Darren Ferguson about umbraco 5, umbraco jupiter, ferguson moriyama written on 27 January 2012",
    "tags": "umbraco 5, umbraco jupiter, ferguson moriyama",
    "bodyText": "\r\n<p><strong><em>Before I begin, a dedication - I wouldn't have got\r\nthrough this blog post unless I had the wonderful Matt Brailsford,\r\nDoug Robar and Sebastiaan Jansen as Skype contacts - these guys are\r\nMVP for a reason! #h5yr</em></strong></p>\r\n\r\n<p>Yesterday I started to build the new Ferguson Moriyama website\r\nin Umbraco 5, and as promised in my previous blog post I've\r\ndocumented the process.</p>\r\n\r\n<p>I've started out by designing the document types for the new\r\nFerguson Moriyama site as I usually would. As people maybe\r\nfollowing this as a tutorial I've done a better job of documenting\r\nthese than I usually would for a normal internal project.</p>\r\n\r\n<p>The document types are deliberately as minimal as possible my\r\ncurrent site suffers from bloat where I put in fields for edge\r\ncases that never emerged - things like alternative titles to be\r\nused in place of node names and alternative dates to be used in\r\nplace of the default publish date. This time I'll start with as\r\nlittle as possible and build up. I'm told that deletion of document\r\ntype properties in Umbraco 5 is recoverable by rollback which is\r\ngreat in terms of being agile with your document types.</p>\r\n\r\n<p><a\r\nhref=\"https://docs.google.com/spreadsheet/ccc?key=0AqhzSLUBKgdOdGRiRGluVkNULWJSLVl4QzdiUkh5VFE\">\r\n<img src=\"~/media/127962/blog1_500x303.jpg\"  width=\"500\"  height=\"303\" alt=\"blog1.png\"/></a></p>\r\n\r\n<p style=\"clear: both;\"><em>(You can click on the image above to\r\nview the Google document that I created)</em></p>\r\n\r\n<p>As an aside I'll talk a little about my process. The document\r\nabove is expected to change during the process of the build. I'm a\r\nfirm believer in agility and in fact I believe it is almost\r\nimpossible to specify exactly what you want before you start\r\nbuilding. As I already mentioned, on a typical project I wouldn't\r\nmaintain such a document. I see Umbraco document types as \"self\r\ndocumenting\" and for clients who demand formal specifications I'd\r\nnormally just generate the documentation from the real Umbraco\r\ndocument types. Interestingly (possibly) this is how PDF creator\r\nfor Umbraco came into being.</p>\r\n\r\n<p>The document above contains a few areas which are TBD (to be\r\ndetermined) but I deliberately make assumptions based on Umbraco 4\r\nknowing that I can return later as my knowledge of version 5\r\nincreases.</p>\r\n\r\n<p><strong><em>Creating the document types</em></strong></p>\r\n\r\n<p>So I head off to the settings section of Umbraco 5 armed with my\r\ndocument type specs and everything looks reassuringly familiar.</p>\r\n\r\n<p>I hesitate slightly creating a document type called\r\n<strong><em>Master</em></strong> because it sounds a little too\r\ngeneric and has some connotations of .net master pages but I let it\r\nslide. As an aside I'd normally put a site specific prefix in front\r\nof my document types but in this case I'm confident that this\r\ninstance of Umbraco will only ever host the Ferguson Moriyama\r\nsite.</p>\r\n\r\n<p>The first new feature that I notice is stricter control over\r\ndocument type inheritance; I like that by checking\r\n<strong><em>Inheritable Only</em></strong> on the\r\n<strong><em>Composition</em></strong> tab that I can say that this\r\ndocument type cannot be directly created as an instance of a node.\r\nBeing a pedant I'm also pleased to see the <strong><em>Generic\r\nProperties</em></strong> tab is now called <strong><em>General\r\nProperties</em></strong> :)</p>\r\n\r\n<p><a href=\"/media/127947/2.png\"><img src=\"~/media/127947/2_498x275.jpg\"  width=\"498\"  height=\"275\" alt=\"2.png\"/></a></p>\r\n\r\n<p style=\"clear: both;\">After 30 minutes or so of playing, Umbraco\r\n5 looks to be in a satisfyingly familiar state. I hit one or two\r\nsnags - the one that sticks in memory is that I couldn't add\r\nproperties to inherited tabs but I am told that this is just a\r\ntemporary glitch.</p>\r\n\r\n<p><strong><em>Create some nodes</em></strong></p>\r\n\r\n<p>Document type hierarchy all worked in a familiar way - I headed\r\nover to the Content section and created a Document of type\r\n<strong><em>Home</em></strong> with two child nodes of type\r\n<strong><em>Text Page</em></strong>.</p>\r\n\r\n<p>Again, everything is looking pretty much as I'm used to.</p>\r\n\r\n<p>&nbsp;<a href=\"/media/127952/3.png\"><img src=\"~/media/127952/3_496x295.jpg\"  width=\"496\"  height=\"295\" alt=\"3.png\"/></a></p>\r\n\r\n<p style=\"clear: both;\"><strong><em>Add some\r\ntemplates</em></strong></p>\r\n\r\n<p>For now I decided to just add a Home Page template and output a\r\nproperty or two, then I'll move on to versioning what I've built to\r\ndate. No CSS or anything to make the pages look pretty yet, just\r\nsome ugly markup.</p>\r\n\r\n<p>Associating templates with document types is again a very\r\nfamiliar experience to those of you who are familiar with Umbraco 4\r\n- the big difference comes when creating templates, which are no\r\nlonger master pages but <strong><em>Razor views</em></strong>.</p>\r\n\r\n<p>I spent a bit of time messing around here, and I understand that\r\nsome of the objects exposed to the view by default are subject to\r\nchange.</p>\r\n\r\n<p>Umbraco 5 has a default template (or View) called\r\n<strong><em>_Layout.cshtml</em></strong> which is in\r\n<strong><em>~/Views/Umbraco</em></strong> this is synonymous to a\r\nMaster page in Umbraco 4 and will be familiar to those who have\r\nadopted ASP.net MVC prior to looking into Umbraco v5. I'm not sure\r\nif it is bad from to modify the default view but I do so.</p>\r\n\r\n<p>At this stage I'm finding the terminology a little confusing,\r\nthe Umbraco 5 UI still uses the terminology\r\n<strong><em>master</em></strong> and\r\n<strong><em>template</em></strong> -I guess to remain familiar to\r\nUmbraco 4 developers but there is a bit of internal conflict as my\r\nmind thinks about <strong><em>Views</em></strong>.</p>\r\n\r\n<p>&nbsp;<a href=\"/media/127957/4.png\"><img src=\"~/media/127957/4_498x275.jpg\"  width=\"498\"  height=\"275\" alt=\"4.png\"/></a></p>\r\n\r\n<p style=\"clear: both;\">I end up with the following layout which\r\ndoes a few familiar things:</p>\r\n\r\n<ul>\r\n<li>Output document title</li>\r\n\r\n<li>Output a (recursive) document type property</li>\r\n\r\n<li>Render a child view</li>\r\n</ul>\r\n\r\n<p><strong><em>Back it up</em></strong></p>\r\n\r\n<p>So I've achieved a lot in a short space of time but before I go\r\nI want to make sure that my customisations to Umbraco 5 are\r\nversioned and separated in a way that I can roll them out to a new\r\nversion of Umbraco or revert to a previous version should I break\r\nanything.</p>\r\n\r\n<p><strong><em>Or maybe not</em></strong></p>\r\n\r\n<p>I take a precursory glance over the database and the file system\r\nand it isn't easy to figure out how document types are stored. I\r\nfind some information relating to my document types in a table\r\ncalled <strong><em>AttributeSchemaDefinition</em></strong> but the\r\ndata model uses GUIDs as identifiers and there appear to be some\r\nquite complex relationships between the tables. It certainly isn't\r\na 5 minute job to work out how it all hangs together.</p>\r\n\r\n<p>My Umbraco HQ contacts aren't on Skype and I feel like I've\r\nharassed them enough for today so I decide to quit for the day.</p>\r\n\r\n<p>For now I'll backup my SQL CE database - after all it is just a\r\nfile - and I'll come back to this later when I have a bit more\r\nenergy. I'm really hoping that moving document types between\r\ninstances was a design consideration of Umbraco 5. Perhaps this is\r\nwhere Courier vNext will come into play?</p>\r\n\r\n<p><em><strong>Next Time</strong></em></p>\r\n\r\n<p>I'll look at adding CSS and JavaScript to Umbraco 5 and\r\ncompleting my homepage. I'll also look into how to create my top\r\nnavigation.</p>\r\n",
    "commentsDisabled": 0
  },
  "Template": "Post",
  "CacheTime": null,
  "SortOrder": 1,
  "Level": 5
}