{
  "Name": "NClassifier: Auto tag posts",
  "Type": "BlogPost",
  "CreateDate": "2006-09-21T16:40:00",
  "UpdateDate": "2015-01-19T18:33:02",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2006/9/21/nclassifier-auto-tag-posts/",
  "RelativeUrl": "/2006/9/21/nclassifier-auto-tag-posts/",
  "Content": {
    "umbracoUrlAlias": "/nclassifier-auto-tag-posts",
    "HideInNavigation": true,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2006-09-21T16:40:00Z",
    "title": "",
    "shortUrl": "http://bit.ly/e0f2AA",
    "summary": "'NClassifier: Auto tag posts' - a blog post by Darren Ferguson about Amazon, XML, Technology Internet written on 21 September 2006",
    "tags": "Amazon, XML, Technology Internet",
    "bodyText": "<p>A while back I read <a href=\"http://ismail.umbraco.net/2006/7/19/nclassifier.aspx\">Ismail's post</a> on <a href=\"http://nclassifier.sourceforge.net/\">NClassifier</a>. I've always been interested in content intelligence and decided to look into auto tagging blog posts and creating document summaries.</p><p>I'm not new to this game and I still feel that humans do a much better job of summarising text than machines, however the tagging using the BayesianClassifier works quite well.</p><p>I've put together a very simple demo which classifies blog posts based on this <a href=\"http://www.fergusonmoriyama.com/classify.xml\">simple xml configuration</a>. If you click through to the detail view of any blog post, you'll see the result of the classification just before the comments.</p><p>Ultimately, I'd probably implement this as an Umbraco actionhandler which sets metadata against items as they are published, but for now classification runs on each request.</p><p>If you are wondering what the purpose of this is, think about the technology behind Amazon recommendations and numerous sites that implement 'you may be interested in this' functionality. Once your content is classified, it isn't too hard to track which tags that your users are looking at most and assemble custom content for them.</p>",
    "commentsDisabled": ""
  },
  "Template": "Post",
  "CacheTime": null,
  "SortOrder": 2,
  "Level": 5
}