{
  "Name": "You are now an ordained minister",
  "Type": "BlogPost",
  "CreateDate": "2006-10-26T18:50:00",
  "UpdateDate": "2015-01-19T18:33:02",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2006/10/26/you-are-now-an-ordained-minister/",
  "RelativeUrl": "/2006/10/26/you-are-now-an-ordained-minister/",
  "Content": {
    "umbracoUrlAlias": "/you-are-now-an-ordained-minister",
    "HideInNavigation": false,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2006-10-26T18:50:00Z",
    "title": "",
    "shortUrl": "http://bit.ly/fRgCXQ",
    "summary": "'You are now an ordained minister' - a blog post by Darren Ferguson about minister, Modesto, California, United Kingdom, Kevin Andrews, LONDON, Universal Life Church International Headquarters, Universal Life Bookstore, online shopping cart, ministerial services, online discussion forum, online directory, circumcision, DARREN FERGUSON, ordained minister, ULC minister written on 26 October 2006",
    "tags": "minister, Modesto, California, United Kingdom, Kevin Andrews, LONDON, Universal Life Church International Headquarters, Universal Life Bookstore, ministerial services, ordained minister, ULC minister",
    "bodyText": "\r\n<p>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br />\r\n This is to confirm that</p>\r\n\r\n<p>DARREN FERGUSON<br />\r\n LONDON UK NW3 6AG UK</p>\r\n\r\n<p>has been ordained as a minister of the Universal Life Church,\r\nModesto, California.</p>\r\n\r\n<p>Date of Ordination: 10/18/2006</p>\r\n\r\n<p>by Kevin Andrews, Pastor<br />\r\n www.ulc.net<br />\r\n ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~</p>\r\n\r\n<p>Your request for ordination has been processed, and you are now\r\nan ordained minister of the Universal Life Church in Modesto,\r\nCalifornia! Please record the above date of ordination for your\r\nrecords, as you may need this information in the future to fill out\r\nthe various forms of the clergy. If you were ordained previously,\r\nthe above date will constitute a valid date upon which you were\r\nRE-ordained. Ordination is for life, without price, and without\r\nquestion of your specific beliefs. You do not need to pay any\r\ntithe, donation, or offering of any kind, now or in the future.</p>\r\n\r\n<p>Ordinations are individually reviewed and forwarded to Universal\r\nLife Church International Headquarters in Modesto, California,\r\nwhere it will be recorded in the permanent church records.</p>\r\n\r\n<p>As a minister, you are authorized by the church to perform the\r\nrites and ceremonies of the church (except circumcision), including\r\nweddings, funerals, baptisms and blessings, subject to the laws of\r\nyour country, state, or locality. Prior to conducting any civil\r\nceremony (such as marriages), you should know and comply with the\r\nlaws pertaining to your area of jurisdiction.</p>\r\n\r\n<p>You are entitled to all privileges and courtesies normally\r\noffered to members of the clergy.</p>\r\n\r\n<p>Your commitment is to always do the right thing. It is your\r\nresponsibility to peacefully and sincerely determine the right\r\ncourse of action, and to avoid infringing on the rights of others.\r\nYou alone are responsible for your actions as a minister.</p>\r\n\r\n<p>If you have not already done so, you may subscribe to our ULC\r\nNewsletter online at http://subscribe.ulc.net</p>\r\n\r\n<p>We have an online discussion forum where ULC ministers meet to\r\nengage in fun and interesting communication. You are welcome to\r\njoin in. You'll find it at http://forum.ulc.net</p>\r\n\r\n<p>You may also choose to have yourself listed in our online\r\ndirectory. Please note that only those who have asked to be listed\r\nin the directory are included (not all ministers). The directory\r\nenables ULC folks to find one another, and is also a useful\r\nresource for people looking for a ULC minister in their area to\r\nperform ministerial services. You will find directory at\r\nhttp://ulc.net/directory</p>\r\n\r\n<p>We value and protect your privacy. Your name and other\r\ninformation will not be made public on any listing unless you\r\nspecifically ask to be listed this way. Also, we will never furnish\r\nyour information to an outside agency, or allow it to be used for\r\nany unrelated purpose.</p>\r\n\r\n<p>It is not a piece of paper which makes you a minister. However,\r\nmany people wish to have a certificate, wallet card, or other\r\nrecord of their status as a minister. Such items are particularly\r\nuseful to those who wish to perform marriages. It can serve to\r\nreassure the bride and groom (or their parents!) of the legality of\r\nthe marriage.</p>\r\n\r\n<p>Many ministers like to provide the couple with an authentic\r\nUniversal Life Church Marriage Certificate for them to include\r\namong their wedding keepsakes. Others just want to have a\r\nprofessionally printed certificate as a permanent record of their\r\nordination. With this in mind, we offer an assortment of Clergy\r\nPackages to help you get started quickly and easily in your\r\nministry. These packages contain various documents, literature, and\r\nhelps for various situations. Details on the contents of these\r\npackages follows at the end of this message. Please understand\r\nhowever, that you are not required or expected to purchase\r\nanything, and these items are not necessary for you to have an\r\neffective and meaningful ministry.</p>\r\n\r\n<p>To order one of these packages visit our web site:</p>\r\n\r\n<p>http://ulc.net/shop</p>\r\n\r\n<p>You may order using check or credit card online for quick\r\ndelivery. You may use our online shopping cart to prepare your\r\norder, even if you prefer to mail your payment. At \"checkout\" you\r\nwill have the option to print your order ready to mail. Or just\r\nwrite down your order number if you don't have a printer.</p>\r\n\r\n<p>Send all mail orders to:</p>\r\n\r\n<p>Universal Life Bookstore<br />\r\n PO Box 2039<br />\r\n Citrus Heights CA 95611-2039</p>\r\n\r\n<p>Best wishes in your ministry!</p>\r\n\r\n<p>With warm regards,</p>\r\n\r\n<p>Kevin Andrews, Senior Pastor<br />\r\n Universal Life Church Online<br />\r\n www.ulc.net</p>\r\n",
    "commentsDisabled": 0
  },
  "Template": "Post",
  "CacheTime": null,
  "SortOrder": 1,
  "Level": 5
}