{
  "Name": "Building the new Ferguson Moriyama website in Umbraco 5",
  "Type": "BlogPost",
  "CreateDate": "2012-01-15T17:54:27",
  "UpdateDate": "2015-01-19T18:43:48",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2012/01/17/building-the-new-ferguson-moriyama-website-in-umbraco-5/",
  "RelativeUrl": "/2012/01/17/building-the-new-ferguson-moriyama-website-in-umbraco-5/",
  "Content": {
    "umbracoUrlAlias": "",
    "HideInNavigation": false,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2012-01-17T00:00:00Z",
    "title": "Building the new Ferguson Moriyama website in Umbraco 5",
    "shortUrl": "http://djf.so/znd4iU ",
    "summary": "'Building the new Ferguson Moriyama website in Umbraco 5' - a blog post by Darren Ferguson about Umbraco 5, Ferguson Moriyama written on 17 January 2012",
    "tags": "Umbraco 5, Ferguson Moriyama",
    "bodyText": "\r\n<p>So I need to learn how to use <a\r\nhref=\"http://umbraco.codeplex.com/releases/view/79260\">Umbraco\r\n5</a> - because in a couple of months of time I'll be teaching it\r\nto others. I've played with version 5 during development and\r\ncontributed a few bits of information back to the community but now\r\nis the time to get real.</p>\r\n\r\n<p>I always find that there is nothing like a real project when\r\nlearning a technology. I'd spent the last couple of weeks deciding\r\nwhat would be my proof of concept project, a little afraid to\r\ncommit a client to such as breaking piece of tech and then it hit\r\nme.</p>\r\n\r\n<p>Gathering dust in a folder somewhere on my laptop was a set of\r\nmock-ups for the new Ferguson Moriyama website. So why not?\r\nFerguson Moriyama on Umbraco 5 and blog and screencast about it\r\nstep by step so others can benefit from my experiences during the\r\nprocess.</p>\r\n\r\n<h2>A little project background</h2>\r\n\r\n<p><a\r\nhref=\"http://www.fergusonmoriyama.com/\">FergusonMoriyama.com</a>\r\nhas served me well since 2005 and Umbraco version 2.0.6. My company\r\nwebsite is (and always has been) a secondary channel when it comes\r\nto new business. I'm fortunate enough to have enough repeat\r\nbusiness that I rarely have to convince people that we can help\r\nthem out.</p>\r\n\r\n<p>Having said that the site does need a little TLC, In the 7 years\r\nthat the site has been in service we've diversified the types of\r\nwork we do and that obviously impacts the content we serve. From\r\nbeing a pure services company we now sell some products and as we\r\nprovide training for which we need to take bookings.</p>\r\n\r\n<p>In performing this technology refresh we'll get rid of some of\r\nthe \"shoe-horning\" and hacking of content that has gone before. It\r\nused to be just me updating my Umbraco sites but now there are a\r\nfew of us, it'll be nice to remove those \"special pages that only\r\nDarren can edit\".</p>\r\n\r\n<h2>The Starting point</h2>\r\n\r\n<p>The mark-up that I had built can be viewed on my preview\r\nserver:</p>\r\n\r\n<ul>\r\n<li><a\r\nhref=\"http://static.darren-ferguson.com/markup/home.html\">Home\r\nPage</a></li>\r\n\r\n<li><a\r\nhref=\"http://static.darren-ferguson.com/markup/account.html\">Form\r\nPage</a></li>\r\n\r\n<li><a\r\nhref=\"http://static.darren-ferguson.com/markup/products.html\">Product\r\nPage</a></li>\r\n\r\n<li><a\r\nhref=\"http://static.darren-ferguson.com/markup/our_work.html\">Client\r\nPage</a></li>\r\n</ul>\r\n\r\n<p>When I undertook the refresh of the look and feel I had the\r\nfollowing criteria.</p>\r\n\r\n<ul>\r\n<li>Consistent positioning of content</li>\r\n\r\n<li>Navigation to depth of 3 levels</li>\r\n\r\n<li>Adding a standard form template</li>\r\n\r\n<li>Adding a product template</li>\r\n\r\n<li>Making our contact details more prominent to encourage people\r\nto call us</li>\r\n\r\n<li>Re-writing lots of the copy to focus on a smaller set of\r\nservices that we want to provide</li>\r\n</ul>\r\n\r\n<p>One concern is that I didn't really consider mobile devices very\r\nwell. In the last year I've started to use tablets and phones to\r\nbrowse the site and I'm now kicking myself at the omission. Still\r\nI've decided to move forward with what I have and address it as the\r\nfirst issue post go live.</p>\r\n\r\n<h2>The blog series</h2>\r\n\r\n<p>I'll aim to write each step of this development up as I work on\r\nit. I'll do my best to use screencasts and screen grabs where\r\nappropriate. The aim is to make things fairly simple to follow and\r\nthe target audience will be people who are familiar with Umbraco\r\n4.</p>\r\n\r\n<p>I understand that I'm working with a product that is maturing\r\nand expect to hit issues along the way - these will of course be\r\nlogged and reported. I'm not going to put a timescale on this or\r\ncommit to update the blog at regular intervals - I'm phenomenally\r\nbusy just now.</p>\r\n\r\n<h2>Part 1</h2>\r\n\r\n<p>In part 1 of this series (coming sometime soon) I'll look at two\r\nthings:</p>\r\n\r\n<ul>\r\n<li>Designing and implementing my document types</li>\r\n\r\n<li>Versioning my development</li>\r\n</ul>\r\n\r\n<p>The versioning part will also consider a release process - Once\r\nI've versioned my development I'll need to be able quickly release\r\niterations to multiple environments. At the end of each blog post\r\nI'll plan to have the site public facing so you can follow my\r\nprogress.</p>\r\n\r\n<h2>Getting started</h2>\r\n\r\n<p>So before we start the build let's get a development environment\r\nset up. This is really simple as I have the <a\r\nhref=\"http://www.microsoft.com/web/downloads/platform.aspx\">Microsoft\r\nweb platform installer</a> and <a\r\nhref=\"http://www.microsoft.com/web/webmatrix/\">WebMatrix</a>\r\nalready on my machine.</p>\r\n\r\n<p>Here are the steps:</p>\r\n\r\n<ol>\r\n<li>Download <a\r\nhref=\"http://umbraco.codeplex.com/releases/view/80350#DownloadId=327116\">\r\nUmbraco 5 RC 2</a></li>\r\n\r\n<li>Extract to a folder</li>\r\n\r\n<li>Right click and choose <em>Open as a website with Microsoft\r\nWebMatrix</em></li>\r\n\r\n<li>Click run and choose a browser - in my case Chrome</li>\r\n\r\n<li>On the splash screen click the <em>launch installer</em>\r\nlink</li>\r\n\r\n<li>When prompted choose SQL CE as the database - I'll change this\r\nlater.</li>\r\n</ol>\r\n\r\n<p>That is all, an empty vanilla Umbraco 5 up and running. This\r\nleaves me ready to start building my site.</p>\r\n\r\n<p>The screencast below illustrates the steps described above.\r\nThere is no sound.&nbsp;</p>\r\n\r\n<p><a href=\"http://vimeo.com/35093069\"><img src=\"~/media/127581/cast_500x375.jpg\"  width=\"500\"  height=\"375\" alt=\"Screencast frame\"/></a></p>\r\n\r\n<p style=\"clear: both;\"><em>Note: I installed the wrong version of\r\nUmbraco in the cast but the process is the same.</em></p>\r\n",
    "commentsDisabled": 0
  },
  "Template": "Post",
  "CacheTime": null,
  "SortOrder": 1,
  "Level": 5
}