{
  "Name": "Umbraco level 2 training in the UK - Be the first to be certified",
  "Type": "BlogPost",
  "CreateDate": "2010-10-19T09:00:00",
  "UpdateDate": "2015-01-19T18:42:37",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2010/10/19/umbraco-level-2-training-in-the-uk-be-the-first-to-be-certified/",
  "RelativeUrl": "/2010/10/19/umbraco-level-2-training-in-the-uk-be-the-first-to-be-certified/",
  "Content": {
    "umbracoUrlAlias": "/umbraco-level-2-training-in-the-uk-be-the-first-to-be-certified",
    "HideInNavigation": true,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2010-10-19T09:00:00Z",
    "title": "",
    "shortUrl": "http://bit.ly/dJd99d",
    "summary": "'Umbraco level 2 training in the UK - Be the first to be certified' - a blog post by Darren Ferguson about United Kingdom, Ferguson Moriyama written on 19 October 2010",
    "tags": "United Kingdom, Ferguson Moriyama",
    "bodyText": "<p>After meeting with Niels before the Umbraco UK festival last\r\nweek I am pleased to announce that I'll be offering Umbraco Level 2\r\ntraining and certification in the UK through my company Ferguson\r\nMoriyama.</p><p>I've only just agreed to take on the training so there are no\r\nfirm details yet but you can keep up to date by following <a href=\"http://twitter.com/fmoriyama\">@fmoriyama</a> on twitter or by\r\nsending me an email using this <a href=\"http://www.fergusonmoriyama.com/contact.aspx\">contact\r\nform</a>.</p><p>One of the first tasks is to update my site giving full details\r\nof what the training involves along with the prices, practicalities\r\nand sign up forms. You can expect this information to be online\r\ntowards the end of this week.</p><p>Finally if you want the chance to be among the first to be\r\nUmbraco Level 2 certified in the UK then read on.</p><p>Within the next few weeks I'll be doing a \"test course\" to help\r\nme get a little bit of practice in a classroom situation. This\r\ncourse will lead to certification and I'd like 5 experienced\r\nUmbraco guys to come along. In return for easing me in to being a\r\ntrainer you'll get a discount of nearly half the usual price.</p><p>Places on this course are on a first come first served basis so\r\nplease email with your details as soon as possible.</p><p>Hope to be training you soon!</p>",
    "commentsDisabled": ""
  },
  "Template": "Post",
  "CacheTime": null,
  "SortOrder": 1,
  "Level": 5
}