{
  "Name": "Neil Fenwick",
  "Type": "BlogComment",
  "CreateDate": "2011-03-25T16:03:01",
  "UpdateDate": "2015-01-19T18:42:38",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2010/4/6/uk-government-it-incompetence-hmcourts-servicegovuk/neil-fenwick/",
  "RelativeUrl": "/2010/4/6/uk-government-it-incompetence-hmcourts-servicegovuk/neil-fenwick/",
  "Content": {
    "umbracoUrlAlias": "",
    "HideInNavigation": true,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2010-04-06T13:54:11Z",
    "title": "Neil Fenwick",
    "name": "Neil Fenwick",
    "email": "neil.fenwick@gmail.com",
    "website": "http://codeoverview.com",
    "bodyText": "I've filled out one of those forms before.  Ended up typing in a word processor to do my char/line count for me.  But I'm a web developer too and have a little imagination when it comes to problem solving.  It is a waste of money building a website to try to increase efficiency, if that website is not accessible to the widest possible audience.\r\n\r\nTwo things:\r\n\r\nNo more than 1080 characters:  I'll bet that there's no javascript counter to tell you how many you've used so far. I wonder if it crossed the minds of civil service that it might not be efficient to count to 1080 manually... nah.\r\n\r\nInternet Explorer only:\r\nSee this petition on the number10.gov.uk website http://petitions.number10.gov.uk/ie6upgrade/ and note that it only stops canvassing in Feb 2011, let alone getting through to the people who count.  I think we'll are a LONG way off getting them to change from IE-only. My guess - minimum turnaround of a year to test browser compatibility and that's only if they don't have internal software that has IE-only specifications.\r\n\r\nI wonder what would happen if you replied with some links to accessibility laws and refer them back to their response :-P\r\n\r\nI'll second you for any appointment as web advisor to government :)",
    "ip": "",
    "isSpam": ""
  },
  "Template": "",
  "CacheTime": null,
  "SortOrder": 1,
  "Level": 6
}