{
  "Name": "2012 Year of the writer",
  "Type": "BlogPost",
  "CreateDate": "2012-01-03T09:37:21",
  "UpdateDate": "2015-01-19T18:43:48",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2012/01/03/2012-year-of-the-writer/",
  "RelativeUrl": "/2012/01/03/2012-year-of-the-writer/",
  "Content": {
    "umbracoUrlAlias": "",
    "HideInNavigation": false,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2012-01-03T09:25:00Z",
    "title": "2012 Year of the writer",
    "shortUrl": "http://djf.so/v1zlqs",
    "summary": "'2012 Year of the writer' - a blog post by Darren Ferguson about resolutions, goals, 2012 written on 03 January 2012",
    "tags": "resolutions, goals, 2012",
    "bodyText": "\r\n<p>For some reason it is traditional at the end of each year to\r\nreflect, self-criticise and create a personal development plan for\r\nthe coming year. The colloquial term - I believe - &nbsp;is <em>new\r\nyear resolutions</em>. I've resisted doing this all of my life,\r\nknowing myself far too well to believe that I would ever stick to\r\nany half arsed commitments &nbsp;- with me it has to be something\r\nthat I truly want to achieve.</p>\r\n\r\n<p>I do something slightly different - each year for the past 3 or\r\n4 years I've written a list of goals. At first glance they may\r\nappear to be just another set of resolutions but I have a few\r\nrules.</p>\r\n\r\n<p>A goal needs to be positive and free of any negative\r\nconnotations, thinks like <em>\"I must not\"</em> or <em>\"I will\r\nnot\"</em> don't work for me. &nbsp;I also try and avoid any binary\r\ngoals that could be failed by a single action -&nbsp;<em>I will\r\nexercise every day</em> can be broken by a day of abstinence <em>I\r\nwill exercise regularly</em> cannot.</p>\r\n\r\n<p>For me my goals for the year should all be achievable, gradual,\r\nmeasurable and inspirational - by gradual I mean a goal that I can\r\nwork on measuring success along the way and take small amounts of\r\nsatisfaction from my progress therefore keeping me\r\n<em>inspired</em>.</p>\r\n\r\n<p>So why am I telling you about this?</p>\r\n\r\n<p><strong>My 1<sup>st</sup> goal for 2012:</strong>&nbsp;<em>To\r\nwrite and Present more</em>.</p>\r\n\r\n<p>In 2011 one of my goals was to conquer a long term fear of\r\npublic speaking. The idea of standing up in front of a crowd of\r\npeople terrified me. The only way I knew to overcome &nbsp;this was\r\nto put myself into the situation that scared me and confront it\r\nhead on.</p>\r\n\r\n<p>Last year I spoke at CodeGarden 11 about <a\r\nhref=\"http://stream.umbraco.org/video/2196556/multi-language-websites-in\">\r\nmulti-language websites in Umbraco</a> and at the Umbraco UK\r\nfestival about <a\r\nhref=\"http://www.youtube.com/watch?feature=player_embedded&amp;v=S8evy72wpmM\">\r\nbuilding commercial Umbraco packages and the Umbraco deli</a>.</p>\r\n\r\n<p><em>The result?</em> I'm still alive. Although I could never\r\ndescribe the experiences as being fun and comfortable I've\r\nre-assured myself that I'm capable. Teaching the Umbraco Level 2\r\ncourse prepared me by getting me used to presenting to small groups\r\nof people. Some of my worries about public speaking were even\r\naddressed in the classes, forgetting what I was going to say,\r\nhecklers etc.</p>\r\n\r\n<p>In 2012 I'd like to get better at speaking in public, to be more\r\nconfident about it and maybe even to enjoy myself a little. The\r\nsecond part of the goal is to write more.</p>\r\n\r\n<p>When I was a kid I wanted to be a writer, all early school and\r\ncollege reports stated <em>journalist</em> as my intended career.\r\nThen something went wrong, my inner geek was somehow exposed and I\r\nended up programming computers. When I sat down to write out my\r\ngoals for this year I couldn't figure out how, when or why that\r\nhappened but I do remember that I loved to write.</p>\r\n\r\n<p>I think that over the years my ability to write has been blunted\r\nafter churning out many hundred inane technical\r\n<em>\"specification\"</em> documents. The goal for 2012 is to get\r\nback to loving to write, to strike a balance between sound\r\ntechnical documentation and creative and informative articles.</p>\r\n\r\n<p>So that is why you are reading this. I'm not going to do\r\nanything silly like commit to blogging once a week - rewind to my\r\nexplanation offailure in a single actionearlier in this post. I'll\r\nwrap up here and go and find some subject matter for these upcoming\r\nblog posts.</p>\r\n\r\n<p><strong>2012:</strong> <em>To write and Present more.</em></p>\r\n",
    "commentsDisabled": 0
  },
  "Template": "Post",
  "CacheTime": null,
  "SortOrder": 1,
  "Level": 5
}