{
  "Name": "A weekend in London",
  "Type": "BlogPost",
  "CreateDate": "2009-02-14T18:42:00",
  "UpdateDate": "2015-01-19T18:41:20",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2009/2/14/a-weekend-in-london/",
  "RelativeUrl": "/2009/2/14/a-weekend-in-london/",
  "Content": {
    "umbracoUrlAlias": "/a-weekend-in-london",
    "HideInNavigation": true,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2009-02-14T18:42:00Z",
    "title": "",
    "shortUrl": "http://bit.ly/dYl6pX",
    "summary": "'A weekend in London' - a blog post by Darren Ferguson about London, Leicester square, Waterloo pier, Bankside pier, Blackfriars pier, St. Pauls Cathedral, Vibe bar, Patisserie Valerie, Buckingham palace, Chalk Farm station, bank, food hall, Primrose hill, Primrose, engineer, Hospitality Recreation written on 14 February 2009",
    "tags": "London, Leicester square, Waterloo pier, Bankside pier, Blackfriars pier, St. Pauls Cathedral, Vibe bar, Patisserie Valerie, Buckingham palace, Chalk Farm station, bank, food hall, Primrose hill, Primrose, engineer, Hospitality Recreation",
    "bodyText": "<p>As a Londoner I'm often asked by friends to recommend places to go and things to see when they visit London. My career and my passion for travel has taken me around the world and I've met a number of people who end up visiting my home 'town'.</p><p>I'm often reluctant to recommend. What if my visiting acquaintance doesn't like a nice cosy pub as I do? What if they love to shop and hunt out bargains? I loathe shopping with a passion.</p><p>Anyway, here is what I would do if I was limited to a weekend. I'll make a few assumptions. First, you are energetic and keen to fit a lot in. Second, you are fit and able bodied and open minded. Finally, you aren't travelling on a shoe string budget. While I wouldn't send you anywhere that would break the bank you'll need to spend a few pounds in order to make the most of a trip. Oh, and I almost forgot, I'll assume that the sun is shining.</p><p>Here goes...</p><p>Arrive on Friday night, preferably at <a href=\"http://www.londoncityairport.com/\">city airport</a> and head east to <a href=\"http://en.wikipedia.org/wiki/Brick_Lane\">Brick lane</a> for a curry. After dinner have drinks at the <a href=\"http://www.vibe-bar.co.uk/\">Vibe bar</a> or <a href=\"http://www.93feeteast.co.uk/\">93 feet east</a>. If you are feeling super energetic see what is going on at <a href=\"http://www.sosho3am.com/\">Sosho</a>, Cargo or <a href=\"http://www.electricityshowrooms.co.uk/index.asp\">Electricity showrooms</a> before getting a good night of sleep.</p><p>Saturday morning, get up early and have breakfast at <a href=\"http://www.restaurant-guide.com/patisserie-valerie-knightsbridge.htm\">Patisserie Valerie</a> in Knightsbridge. Have a wander around <a href=\"http://www.harrods.com/harrodsstore/\">Harrods</a> for an hour or two making sure that you check out the food hall. Jump on the tube and head over to Camden. You may enjoy the market - I don't - but if the chaos isn't for you get off at Chalk Farm station rather than Camden to avoid it all. Grab lunch at <a href=\"http://www.london-eating.co.uk/3257.htm\">Thanh Binh</a> one of the best cheap Vietnamese restaurants in London, I recommend the Pho.</p><p>After lunch, walk to the top of <a href=\"http://en.wikipedia.org/wiki/Primrose_Hill\">Primrose hill</a> for one of the best views of the whole city. On the way back to the tube, stop for a pint or two outside <a href=\"http://www.the-engineer.com/\">The engineer</a> or <a href=\"http://www.beerintheevening.com/pubs/s/13/1345/Queens/Primrose_Hill\">The queens</a>.</p><p>I'd suggest a rest at this point so you can make the most of your evening. For dinner book <a href=\"www.latiumrestaurant.com\">Latium</a> and have cocktails before/after at the <a href=\"http://www.sandersonlondon.com/\">Sanderson</a>.</p><p>You are on your own for the evening. I don't really do clubbing any more, but the one piece of advice I give is don't just wander to Leicester square and choose a venue, there are some absolute hovels. If you are just after a few more drinks after dinner I like the bar at the <a href=\"http://www.hotels-london.co.uk/charlotte-street.hotel\">Charlotte street hotel</a>.</p><p>Sunday morning, make sure you enjoy a full <a href=\"http://en.wikipedia.org/wiki/Full_breakfast\">English breakfast</a> to start your day. Your hotel probably serves one and to be honest there isn't any particular culinary skill involved in making one so it is hardly worth hunting down an 'authentic greasy spoon' cafe.</p><p>Get a tube to Westminster and walk over the bridge enjoying the uber tourist views of <a href=\"http://en.wikipedia.org/wiki/Big_Ben\">Big ben</a> and the <a href=\"http://www.parliament.uk/\">houses of parliament</a>. Get a boat from Waterloo pier next to the London eye to Bankside pier, browse <a href=\"http://www.tate.org.uk/\">Tate modern</a> for a while then cross the river using the <a href=\"http://en.wikipedia.org/wiki/Millennium_Bridge_(London)\">millennium foot bridge</a>, head up to <a href=\"http://www.stpauls.co.uk/\">St. Pauls Cathedral</a> and check out the <a href=\"http://www.explore-stpauls.net/oct03/textMM/WhisperingGalleryN.htm\">whispering gallery</a>.</p><p>Make sure you use the Thames Clippers commuter boats. The tourist boats are over priced and very slow.</p><p>Back on the boat to Greenwich, from Blackfriars pier. Walk through the grounds of the <a href=\"http://www.oldroyalnavalcollege.org/\">naval college</a> and into the park, up to the <a href=\"http://www.nmm.ac.uk/places/royal-observatory/\">observatory</a> for another view over London. If you have time check out the three markets in Greenwich.</p><p>Finish your trip with a late <a href=\"http://en.wikipedia.org/wiki/Sunday_roast\">Sunday roast</a> and a beer at the <a href=\"http://www.beerintheevening.com/pubs/s/12/1200/Plume_of_Feathers/Greenwich\">Plume of feathers</a> (you'll need to book a sitting at 2 or 4pm). Get on the DLR and head back to city airport!</p><p>That is just one of many ways of spending a weekend in London. I missed out <a href=\"http://en.wikipedia.org/wiki/Fish_and_chips\">Fish and Chips</a>, some great markets and many of my favourite pubs simply because of time constraints. I also tried to leave plenty of spare time between my recommendations so you can wander off the beaten track and discover your own London - in my experience, just wandering is one of the true joys of travel.</p><p>My final tip, here is what  to avoid. Leicester Square, Theatre Land, The London eye, Buckingham palace. Some Londoners may passionately disagree, but I think you'd be wasting valuable time.</p><p>So, if you are reading this and thinking of visiting, enjoy my city. Arguably the greatest on earth.</p><p>I'd also be fascinated to hear other Londoners 'top tips'.</p>",
    "commentsDisabled": ""
  },
  "Template": "Post",
  "CacheTime": null,
  "SortOrder": 1,
  "Level": 5
}