{
  "Name": "Thoughts on Autonomy Interwoven Gearup",
  "Type": "BlogPost",
  "CreateDate": "2009-05-28T20:49:00",
  "UpdateDate": "2015-01-19T18:41:19",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2009/5/28/thoughts-on-autonomy-interwoven-gearup/",
  "RelativeUrl": "/2009/5/28/thoughts-on-autonomy-interwoven-gearup/",
  "Content": {
    "umbracoUrlAlias": "/thoughts-on-autonomy-interwoven-gearup",
    "HideInNavigation": true,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2009-05-28T20:49:00Z",
    "title": "",
    "shortUrl": "http://bit.ly/hxHAXk",
    "summary": "'Thoughts on Autonomy Interwoven Gearup' - a blog post by Darren Ferguson about Autonomy Interwoven, Claridges, Toby Bell, London, British Airways, Europe, United States, e - commerce, actual real time results, technology first, basic web standards, content management, search engines, synonym processing, US Federal Reserve, independent Interwoven consultant, XML, Autonomy technology, OCR, AV, facial recognition, GUI, Technology Internet written on 28 May 2009",
    "tags": "Autonomy Interwoven, Claridges, Toby Bell, London, British Airways, Europe, United States, e - commerce, actual real time results, technology first, basic web standards, content management, search engines, synonym processing, US Federal Reserve, independent Interwoven consultant, XML, Autonomy technology, OCR, AV, facial recognition, GUI, Technology Internet",
    "bodyText": "<p><a href=\"/media/52834/WindowsLiveWriter_ThoughtsonAutonomyInterwovenGearup_B168_photo_4.jpg\"><img src=\"/media/77608/9949_1.jpg\" width=\"184\" height=\"244\" alt=\"photo\" class=\"top\" style=\"border-top-width: 0px; display: inline; border-left-width: 0px; border-bottom-width: 0px; border-right-width: 0px\" /></a> Yesterday I attended\r\n<a href=\"http://www.interwoven.com/templatedata/events/gearup_2009/iwov/index.html\">\r\nAutonomy Interwoven gearup</a> at <a href=\"http://www.claridges.co.uk/\">Claridges</a> in London.\r\nInterwoven were recently <a href=\"http://www.interwoven.com/components/pagenext.jsp?topic=NEWS::RELEASES&amp;dcr=templatedata/announcement/press-release/data/2009/dcr-autonomy.xml\">\r\nacquired by Autonomy</a> and as an independent Interwoven\r\nconsultant with nearly 10 years experience I was keen to learn\r\nabout the Autonomy product suite and how their integration into the\r\nInterwoven product suite would affect my day to day work.</p><p><strong>An Introduction:</strong></p><p>The day was presented in a slick style with an even slicker\r\naccompanying audio/visual presentations - I counted six AV\r\ntechnicians seated behind a black screen at the back of the room.\r\nThe audience was a mix of technical, sales and marketing people\r\nfrom Autonomy Interwoven partners and customers. The tone was very\r\nmarketing based - the whole day was really about how to to increase\r\nrevenue through your website using Autonomy products. A large\r\nproportion of the audience wanted something different, in an\r\ninteractive vote at the end of the day 38% of the audience voted\r\nthat they'd like to see \"more technical content\" at the next\r\ngearup, twice the percentage of any other option.</p><p>Throughout the day I felt that the confidence of some of the\r\npresenters bordered on arrogance we were told that \"Interwoven\r\ninvented web content management\" and there were constant references\r\nto Autonomy technology being market leading with \"no competitors\".\r\nInterestingly some of those who had worked with IDOL referred to it\r\nas \"dated\" and \"clunky\" in private conversations. I'm yet to get my\r\nteeth stuck into IDOL personally so I'll reserve judgement but we\r\nwere consistently told throughout the day what the future of\r\ncontent was and how certain practices were dated. On this subject I\r\nfeel compelled to make a point.</p><p><strong>A little rant:</strong></p><p>It is extremely hard to sit and be schooled about the \"future\"\r\nby an organisation whose <a href=\"http://www.interwoven.com/\">corporate website</a> and <a href=\"http://devnet.interwoven.com/\">developer support site</a>\r\nfail to implement some very basic web standards and best practices.\r\nValidating your pages against your declared DTD, Providing RSS\r\nFeeds and SEO friendly URLs are just a few extremely basic items\r\nthat a leading ECM vendor should take the time to implement. Oh,\r\nand you can't search the developer site for key TeamSite\r\nterminology like DCR, XML and TPL because they are too short.\r\nThey've been aware of this for years and it never changes.</p><p><strong>What I learned:</strong></p><p>A few quick bullet points:</p><ul><li><a href=\"http://www.interwoven.com/components/pagenext.jsp?topic=PRODUCT::TEAMSITE\">\r\nTeamSite</a> 7 and <a href=\"http://www.interwoven.com/components/pagenext.jsp?topic=PRODUCT::LIVESITE\">\r\nLiveSite</a> 7 to ship this year - focus will be on more IDOL\r\nintegration.</li><li>LiveSite runtime available for .net platform.</li><li>Autonomy pledged continued support for all Interwoven products\r\n(including <a href=\"http://www.interwoven.com/components/pagenext.jsp?topic=PRODUCT::METATAGGER\">\r\nMetaTagger</a>).</li><li>Autonomy have doubled the number of trained support staff.</li></ul><p><strong>IDOL:</strong></p><p>We were introduced to <a href=\"http://www.autonomy.com/idolserver\">IDOL server</a>\r\n(Intelligent Data Operating Layer). TeamSite 6.7.2 SP1 ships with\r\nIDOL server and from what I understand all content that is entered\r\ninto TeamSite is also consumed by IDOL via some kind of connector.\r\nIDOL is able to analyse unstructured content from a variety of\r\nsources - audio, video, email and many more - and \"understand\" it's\r\nmeaning. There are lots of technologies in play here - OCR, speech\r\nto text, facial recognition to name a few - but the high level\r\nconcept is that you can throw just about anything at IDOL (with\r\nminimal configuration) and it understands.</p><p>Let me explain a little about \"understands\". Like the rest of\r\nthe day the notion of content being understood was reasonably vague\r\nbut a lot of emotive language was used. IDOL can gauge sentiment,\r\nmood, intimacy and so on. My interpretation is that Autonomy are\r\ntrying to tell us that their software is smart and it does all of\r\nthat classification, summarisation, stemming and synonym processing\r\nwithout you having to think. They were also trying to tell us that\r\nit does more than that, an example given was how a search for dogs\r\ncould yield results on Labradors and how IDOL may have a notion\r\nthat dogs are used by the police. Good stuff maybe, but a bit too\r\nhigh level for my liking.</p><p>The demonstrations that we were given were unclear as to how\r\ndata is retrieved from IDOL though I got the impression that\r\nSitePublisher components are shipped with the new version of\r\nTeamSite which somehow query the IDOL repository. I was also left\r\nunclear as to where IDOL sits within my environment - on the CMS\r\nserver, in my production environment - and what kind of hardware\r\nresources it requires. I'm also wondering where the revenue comes\r\nfrom - If we get IDOL server for free what do we have to buy? Are\r\nwe getting hooked on this new technology first and the paid for\r\nstuff that we can't resist gets brought into play later?</p><p>To be honest it was a bit of an information overload with IDOL,\r\nwe saw it create tag clouds of user sentiment, create user\r\nprofiling, recognise people words and video and I must admit it\r\nleft me wanting to try it out. One point of note was that we were\r\nshown a scenario where a customer dialling in to a call centre\r\ncasually mentioned the Chicago cubs and was presented with an\r\napplication form for a Cubs credit card the next time they visited\r\nthe company website. This may be fine in the US, I'd be a bit\r\ncareful about that kind of behaviour in Europe though - perhaps do\r\nsome reading up ob <a href=\"http://en.wikipedia.org/wiki/Phorm\">PHORM</a>.</p><p>There was also an impressive demo of <a href=\"http://www.interwoven.com/components/pagenext.jsp?topic=PRODUCT::MEDIABIN\">\r\nMediaBin</a> combined with Autonomy Virage - now one product -which\r\nwas able to automatically transcribe a video audio track. The\r\ndemonstration ware pre-recorded. It would have been much more fun\r\nto see a video of one the presentations on the day fed into the\r\nsoftware so we could see the actual real time results. Text to\r\nspeech is still far from perfect and audio tracks which aren't\r\nclear and regional accents can still confuse the hell out of some\r\nsystems. If Autonomy wanted to show us how powerful their software\r\nwas they should have let a member of the audience talk to it.</p><p><strong>Integrated Analytics:</strong></p><p>Well no, not really. The new version of TeamSite allows you to\r\nview some analytical data <strong>*if*</strong> you are a <a href=\"http://www.webtrends.com/\">Webtrends</a> customer. To be\r\nhonest it wasn't that impressive it was just a bunch of standard\r\nWebtrends reports linked to from the contentcenter GUI.</p><p><strong>Optimost:</strong></p><p>TeamSite 6.7.2 SP1 also has an optional (paid for) component\r\nthat allows you to test different permutations of a web page in\r\norder to determine which was most successful - aka multi-variable\r\ntesting - success is gauged by the user reaching a 'goal' page on\r\nyour website. The permutations would be subtle copy or colour\r\nchanges in your website and you are able to rule out specific\r\npermutations to gradually reach the 'winner' page. I wasn't sure\r\nabout this personally as I didn't like the idea of an ever changing\r\npage and how this would affect it's page rank with search engines.\r\nThere was no demonstration of how the test results are presented\r\nand whether it breaks users down by any demographics within the\r\nresults, but I did speak to a user from British Airways who was\r\nvery satisfied with the result that <a href=\"http://www.optimost.com/\">Optimost</a> had yielded and he\r\nclaimed that the optimisations that they had made had easily paid\r\nfor the software in a very short space of time.</p><p><strong>A few moans:</strong></p><p>I didn't like the fact that the executive Q&amp;A session wasn't\r\nopened up to the floor, we had to provide our questions on paper at\r\nthe end of the first session and they were vetted over the\r\nfollowing hour before the ones which were selected were asked to\r\nthe company executives on stage. I also thought that each\r\nindividual presentation could have been opened up to questions at\r\nthe end, but each presenter finished up exited the stage and the\r\nnext demonstration video kicked in.</p><p>In my opinion they could have easily lost a couple of sessions\r\nsuch as Toby Bell of Gartner, a presentation from Fidelity on how\r\nthey built their new website and a Q&amp;A on e-commerce with some\r\nexecutives of Autonomy Interwoven customers. I feel that these\r\nwould have been much better replaced with more audience\r\nparticipation but then again Interwoven have always been quite a\r\nclosed organisation and I hear that Autonomy are even more so. For\r\nthe record I thought Toby Bell delivered a good presentation but it\r\ndidn't relate specifically to any Autonomy Interwoven products.</p><p><strong>To Conclude:</strong></p><p>All in all it was an interesting day. I'm looking forward to\r\ngetting my hands on some of the technology that Autonomy are\r\nbringing to the Interwoven product suite. Unfortunately some of it\r\nwill be forever out of my reach as they don't really do\r\nevaluations. There is a market for technical workshops where\r\ndevelopers like me get our hands on this technology maybe these\r\ncould run alongside gearup in future.</p><p>Claridges is a lovely hotel, lunch was fantastic and it was fun\r\nto catch up with some old colleagues, meet some new people and put\r\nfaces to names of people that I knew by reputation.</p><p>I'd love to here some feedback from any other attendees. I'd\r\nlove to here from Autonomy Interwoven to see whether they think\r\nI've been fair with my comments and particularly on whether they\r\nplan to address any of the basic issues with their corporate sites\r\n- I'm here and very willing to help if you want to be helped!</p><p>If what we saw yesterday is true IDOL Social Media Analysis will\r\nprobably read, classify and derive the meaning and sentiment of my\r\nblog post and let someone at Autonomy know about it. For all I know\r\nit may even respond automatically!</p><p>I'm sure I've missed something, but then a day with so much\r\ndetail is very difficult to summarise.</p>",
    "commentsDisabled": ""
  },
  "Template": "Post",
  "CacheTime": null,
  "SortOrder": 1,
  "Level": 5
}