{
  "Name": "Sometimes I’m mistaken for the son of Alex Ferguson",
  "Type": "BlogPost",
  "CreateDate": "2009-05-14T09:59:00",
  "UpdateDate": "2015-01-19T18:41:19",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2009/5/14/sometimes-i-m-mistaken-for-the-son-of-alex-ferguson/",
  "RelativeUrl": "/2009/5/14/sometimes-i-m-mistaken-for-the-son-of-alex-ferguson/",
  "Content": {
    "umbracoUrlAlias": "/sometimes-i’m-mistaken-for-the-son-of-alex-ferguson",
    "HideInNavigation": true,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2009-05-14T09:59:00Z",
    "title": "",
    "shortUrl": "http://bit.ly/dFNT31",
    "summary": "'Sometimes I’m mistaken for the son of Alex Ferguson' - a blog post by Darren Ferguson about Alex Ferguson, football, Liverpool, United Kingdom, Clive Ferguson, Asia, Europe, Nigeria, Liberia, Sports written on 14 May 2009",
    "tags": "Alex Ferguson, football, Liverpool, United Kingdom, Clive Ferguson, Asia, Europe, Nigeria, Liberia, Sports",
    "bodyText": "<p>When I check into a hotel in Asia approximately 1 in 4 times I'm\r\nasked if I'm the son of <a href=\"http://en.wikipedia.org/wiki/Alex_Ferguson\">Alex\r\nFerguson</a>. Through gritted teeth, I'll reply that I am the son\r\nof Clive Ferguson and a Liverpool supporter as well.</p><p>Yesterday this \"making assumptions based on having the same name\r\nas someone thing\" went a little further than the normal polite\r\nenquiry at a hotel reception desk. My email inbox contained a\r\nmessage from <em>7cristiano7.</em></p><blockquote><p>Hello Sir, My name is and am 16 years old. I live in Liberia. I\r\nhave three years now trying to get help from people to play\r\nfootball in Europe mainly in England, but so far found no one yet.\r\nSir am kid who sees only football ahead of my life. Knowing that\r\nyou are a son of Sir Alex, i therfore neel in tears for you to help\r\nplay football in England. I called you months back to ask for this\r\nhelp but your respond to me like\"this is private no. Dont call this\r\nline again\" made me afraid and i hung up. Sir if you don't really\r\nunderstand what am trying to, please permit me to call you and\r\nexplain. A lot a people tells me\" play football son it is your\r\ncall\".</p></blockquote><p>I did feel a little guilty because as the email suggests I\r\ndidn't give the kid a chance to speak when he called me a few\r\nmonths back. I assumed that it was another skype call where I'd be\r\ntold that I'd won the lottery in Nigeria and all I had to do was\r\nfurnish the caller with my bank details in order to receive riches\r\nbeyond my wildest dreams.</p><p>So any suggestions on how to advise this kid? I composed the\r\nfollowing draft which I am yet to send.</p><blockquote><p>You have the wrong person, I am not Sir Alex Ferguson's son. I\r\njust have the same name.<br />\r\nGood luck with your football career.</p><p><br />\r\nIf you are any good, I'd suggest you play for Liverpool.</p><p>Cheers.</p><p>Darren \"son of Clive\" Ferguson</p></blockquote>",
    "commentsDisabled": ""
  },
  "Template": "Post",
  "CacheTime": null,
  "SortOrder": 1,
  "Level": 5
}