{
  "Name": "mark",
  "Type": "BlogComment",
  "CreateDate": "2011-03-25T16:03:01",
  "UpdateDate": "2015-01-19T18:42:38",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2010/4/10/do-you-speak-french/mark/",
  "RelativeUrl": "/2010/4/10/do-you-speak-french/mark/",
  "Content": {
    "umbracoUrlAlias": "",
    "HideInNavigation": true,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2010-04-10T11:17:18Z",
    "title": "mark",
    "name": "mark",
    "email": "mark@my-touch.co.uk",
    "website": "http://www.silkcafe.co.uk",
    "bodyText": "Google are our SISTER COMPANY\r\n\r\nPhone rings:\r\nMe: Hello Mark speaking.\r\nHer: Im from a company called infoserve?\r\nMe: OK.\r\nHer: And i would like to tell you about our offering today.\r\nMe: and what would that be?\r\nHer: Well Yahoo have now merged with Google and we are taking up the advertising realm and can guarantee you first top page ranking?\r\nMe: Really? Yahoo have merged with Google? Was that a snap buy?\r\nHer: Snap buy?  what do you mean? Our sister company Google has merged with Yahoo and we are making this great offer to you.\r\nMe: Your sister company Google?  wow this gets better... what's your company called again?\r\nHer: Infoserve...\r\nMe: So have you bought Google or has Google bought you?\r\nHer:Well our sister company Google have merged with Yahoo & Microsoft!\r\nMe: Microsoft also? are you really really sure?\r\nHer: Yes, so we can get you on the top of the page because our sister company gives us this offering, nobody else has it.\r\nMe: Nobody else believes it i guess.\r\nHer: What do you mean?\r\nMe: Are you sure  google is your sister company and they have merged with Yahoo and Microsoft?\r\nHer:  Please wait sir, i'm going to get my manager!\r\nShort Pause:\r\nHim:Hello Sir, how can i help?\r\nMe:  Seems your sister company Google has merged with Yahoo & Microsoft, is that correct?\r\nHim: Well we do have a contract with Yahoo to sell their services...\r\nMe: So does that make it your sister company?  What about Google?\r\nHim:  Well we are registered to sell adwords.\r\nMe: I think i've heard enough.\r\nHim:  So your not interested in the great offer of being on page 1?\r\nMe:  I already am on page 1 of google, yahoo if you took the time to check.\r\nHim:  Well it's only £250 for a one off fee.\r\nMe: I also have 'Off\" fee too - starts with 'F' - goodbye!",
    "ip": "",
    "isSpam": ""
  },
  "Template": "",
  "CacheTime": null,
  "SortOrder": 1,
  "Level": 6
}