{
  "Name": "My Thoughts on FOWA Dublin",
  "Type": "BlogPost",
  "CreateDate": "2009-03-30T21:32:00",
  "UpdateDate": "2015-01-19T18:41:19",
  "CreatorName": "Darren Ferguson",
  "WriterName": "Darren Ferguson",
  "Url": "http://localhost/2009/3/30/my-thoughts-on-fowa-dublin/",
  "RelativeUrl": "/2009/3/30/my-thoughts-on-fowa-dublin/",
  "Content": {
    "umbracoUrlAlias": "/my-thoughts-on-fowa-dublin",
    "HideInNavigation": true,
    "umbracoInternalRedirectId": "",
    "redirect": "",
    "displayDate": "2009-03-30T21:32:00Z",
    "title": "",
    "shortUrl": "http://bit.ly/gBJFe8",
    "summary": "'My Thoughts on FOWA Dublin' - a blog post by Darren Ferguson about Dublin, Simon Willison, London, Twitter, nice little tool, web complaining, web applications, social networking, web page layouts, Kick-Ass, Elliott Kember, Robin Christopherson, David Heinemeier Hansson, Blaine Cook, SQL Injection written on 30 March 2009",
    "tags": "Dublin, Simon Willison, London, Twitter, nice little tool, web complaining, web applications, social networking, web page layouts, Kick-Ass, Elliott Kember, Robin Christopherson, David Heinemeier Hansson, Blaine Cook, SQL Injection",
    "bodyText": "<p>This post is a little late, I've been upgrading my blog.</p><p>A couple of weeks ago I attended the <a href=\"http://events.carsonified.com/fowa/2009/dublin/content\">FOWA\r\n\"show\" in Dublin</a>. The use of the word show is from the\r\norganisers <a href=\"http://www.carsonified.com/\">Carsonified</a> -\r\nnot myself - and there was definitely a frustrated rock star air to\r\nthe whole thing. Words/Phrases of the day were \"Awesome\" and\r\n\"Kick-Ass\" and the fuck count was up in the twenties within the\r\nfirst hour.</p><p>The highlights of FOWA for me were as follows:</p><p>Being introduced to <a href=\"http://www.balsamiq.com/products/mockups\">Balsamiq\r\nMockups</a> an nice little tool for producing wire-frames of web\r\npage layouts, though as Elliott Kember points out - in a rather <a href=\"http://www.carsonified.com/web-apps/on-usability/\">long\r\nwinded blog post</a> - it can be dangerous in the wrong hands.\r\nBusiness users could suddenly think they are UI designers who can\r\ndo your job for you.</p><p><a href=\"http://simonwillison.net/\">Simon Willison</a> gave a\r\ngood presentation on security. He talked about XSS and SQL\r\nInjection which we should all know about but also <a href=\"http://en.wikipedia.org/wiki/Cross-site_request_forgery\">CSRF</a>\r\nand <a href=\"http://en.wikipedia.org/wiki/Clickjacking\">Click\r\nJacking</a>. If you aren't familiar with the latter then you should\r\nbe. In summary, consider the following when developing web\r\napplications:</p><ul><li>Don't modify data in get requests.</li><li>Keep Sessions short.</li><li>Don't use a remember me function (either as a user or\r\ndeveloper).</li><li>Don't let your pages be loaded into iFrames - use frame busting\r\nJavascript.</li><li>Add a hidden field to your forms containing a server generated\r\ntoken which should be validated when a form is processed.</li></ul><p>I know I haven't given reasons for the bullet points above, but\r\nthey should be fairly obvious. Hopefully Simon's talk will appear\r\nonline somewhere.</p><p>Finally, <a href=\"http://www.abilitynet.org.uk/webteam\">Robin\r\nChristopherson</a> of ability net gave a presentation using a\r\nscreen reader. Interesting points raised were:</p><ul><li>Auto playing media with sound drowns out the voice of a screen\r\nreader making it impossible to navigate a page.</li><li>Badly written alt tags really mess up the usability of a page.\r\nDespite the fact this is such a well publicised issue massive\r\namounts of developers still don't provide meaningful alt tags.</li><li>The audio equivalent of Captchas are frequently unintelligible,\r\ndespite offering to provide manual assistance during signup large\r\norganisations - including Google - frequently don't.</li></ul><p>I'm now committed to never placing a Capctha on any site that I\r\nwork on in the future.</p><p>Other than the above, the conference was largely uninspiring\r\n(for me). <a href=\"http://www.loudthinking.com/about.html\">David\r\nHeinemeier Hansson</a> from 37 Signals was entertaining but\r\ndelivered a motivational speech rather than anything technical. <a href=\"http://twitter.com/blaine\">Blaine Cook</a> (of Twitter fame)\r\ncame frustratingly close to saying something interesting on several\r\noccasions but ended up delivering a very high level and fluffy talk\r\non social networking. The guys from <a href=\"http://www.contrast.ie/\">Contrast</a> had a good delivery\r\nstyle, but I didn't need to be told that the web is full of\r\nconventions and cliches, I work with it every day. I know.</p><p>Anyone else who spoke just fell of my radar. That isn't a\r\ncriticism, maybe I just wasn't the target audience. I know this\r\npost may come across as being overly negative but it honestly isn't\r\nintended that way. My kind of conference just involves more tech\r\nand more innovative cutting edge stuff.</p><p>I'd be interested in going to FOWD in London, they have two\r\ntracks as opposed to the one offered in Dublin so you can pick and\r\nchoose your speakers.</p><p>So that was my 5 minute summary of FOWA Dublin. There are a load\r\nmore posts all over the web complaining about the WIFI, coffee and\r\npraising/slating various speakers. I've just picked out the bits\r\nand pieces that were relevant to me.</p>",
    "commentsDisabled": ""
  },
  "Template": "Post",
  "CacheTime": null,
  "SortOrder": 2,
  "Level": 5
}